;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! flyspell-lazy)
(package! mu4e-alert)
(package! pass)
(package! org-journal)
(package! avy)
(package! company)
(package! elfeed-org)
(package! info-colors)
(package! flyspell-correct-ivy)
(package! mu4e)
(package! magit-section)
(package! engine-mode)
(package! pinentry)
(package! eshell-git-prompt)
(package! visual-fill-column)
(package! org-mime)
(package! org-tree-slide)
(package! pdf-tools)
(package! link-hint)
(package! vertico)
(package! marginalia)   
(package! swiper)
(package! org-roam)
(package! consult)
(package! elfeed-goodies)
(package! lastfm)
(package! vuiet)
(package! beacon)
(package! org-download)
(package! org-attach-screenshot)
(package! embark)
(package! org-auto-tangle)
(package! vundo)
(package! smartparens)
(package! darkroom)
